#include <iostream>

using namespace std;

int main()
{
	cout << "введите сторону куба: ";
	int N;
	cin >> N;

	for (int i = 1; i <= (N / 3) + 1; i++)
	{
		cout << ' ';
	}
	for (int i = 1; i <= N; i++)
	{
		cout << '*';
	}
	cout << endl;


	for (int i = 1; i <= N / 3; i++)
	{
		for (int j = (N / 3 + 1) - i; j >= 1; j--)
		{
			cout << ' ';
		}
		cout << '*';
		for (int j = 1; j <= N - 2; j++)
		{
			cout << ' ';
		}
		cout << '*';
		for (int j = 1; j <= i - 1; j++)
		{
			cout << ' ';
		}
		cout << '*' << endl;
	}


	for (int i = 1; i <= N; i++)
	{
		cout << '*';
	}	
	
	for (int i = 1; i <= N / 3; i++)
	{
		cout << ' ';
	}
	cout << '*' << endl;


	for (int i = 1; i <= N - (N / 3) - 2; i++)
	{
		cout << '*';
		for (int j = 1; j <= N - 2; j++)
		{
			cout << ' ';
		}
		cout << '*';

		for (int j = 1; j <= N / 3; j++)
		{
			cout << ' ';
		}
		cout << '*' << endl;
	}
	

	for (int i = 1; i <= N / 3; i++)
	{
		cout << '*';
		for (int j = 1; j <= N - 2; j++)
		{
			cout << ' ';
		}
		cout << '*';

		for (int j = (N / 3) - 1; j >= i; j--)
		{
			cout << ' ';
		}
		cout << '*' << endl;
	}


	for (int i = 1; i <= N; i++)
	{
		cout << '*';
	}
	cout << endl;

	return 0;
}
/*______*****
 *_____*___**
 *____*****_*
 *____*___*_*
 *____*___**
 *____*****
 *
 *___***
 *__*_**
 *_***_*
 *_*_**
 *_***
 *			 ___
 *__________*********    ___	пробелов: (N / 3) + 1 
 *_________*_______**		
 *________*_______*_*		в высоту N / 3; пробелы: x (x = [(N / 3) ... 1])
 *_______*_______*__*    ___
 *______*********___*    ___
 *______*_______*___*
 *______*_______*___*		в высоту N - (N / 3) - 2
 *______*_______*___*
 *______*_______*___*    ___
 *______*_______*__*
 *______*_______*_*		в высоту N / 3
 *______*_______**	 ___
 *______*********	 ___
 *
 *
 *
 * */
